### Terraform Plan ✅ No changes
```hcl
module.cloudflare.cloudflare_dns_record.this["A-install"]: Refreshing state... [id=d2234b83d8cd7a5aec2e95d6fb17a68c]
module.workers.cloudflare_worker.this["dotfiles-install-redirect"]: Refreshing state... [id=a589c6d1db9d427e8b08aaae1ff71842]
module.workers.cloudflare_worker_version.this["dotfiles-install-redirect"]: Refreshing state... [id=aa9fa3ad-b4df-441f-9039-112dbddae62b]
module.workers.cloudflare_workers_deployment.this["dotfiles-install-redirect"]: Refreshing state... [id=d8ff1708-6f47-4a5e-b9f7-1a472a9b5a7b]
module.workers.cloudflare_workers_route.this["dotfiles-install-redirect"]: Refreshing state... [id=5058ac357efe40349ec22a6308f3e2c3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.workers.cloudflare_worker_version.this["dotfiles-install-redirect"] must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      + compatibility_flags = (known after apply)
      ~ created_on          = "2025-12-22T15:51:07Z" -> (known after apply)
      ~ id                  = "aa9fa3ad-b4df-441f-9039-112dbddae62b" -> (known after apply)
      + limits              = (known after apply)
      ~ modules             = [
          - { # forces replacement
              - content_base64 = "ZXhwb3J0IGRlZmF1bHQgewogIGFzeW5jIGZldGNoKHJlcXVlc3QpIHsKICAgIHJldHVybiBSZXNwb25zZS5yZWRpcmVjdCgiaHR0cHM6Ly9yYXcuZ2l0aHVidXNlcmNvbnRlbnQuY29tL3RxZXIzOS9kb3RmaWxlcy9tYWluL2luc3RhbGwuc2giLCAzMDIpOwogIH0KfQo=" -> null
              - content_sha256 = "d1ed05aa926eb562d9c70af60e8ad7b79774d206e419e4842c33f553a48d3b61" -> null
              - content_type   = "application/javascript+module" -> null
              - name           = "index.mjs" -> null
            },
          + { # forces replacement
              + content_base64 = "ZXhwb3J0IGRlZmF1bHQgewogIGFzeW5jIGZldGNoKHJlcXVlc3QpIHsKICAgIGNvbnN0IHVybCA9IG5ldyBVUkwocmVxdWVzdC51cmwpOwogICAgY29uc3QgcGF0aCA9IHVybC5wYXRobmFtZTsKCiAgICBsZXQgdGFyZ2V0VXJsOwogICAgaWYgKHBhdGggPT09ICcvd2luZG93cycgfHwgcGF0aCA9PT0gJy93aW5kb3dzLycpIHsKICAgICAgdGFyZ2V0VXJsID0gJ2h0dHBzOi8vcmF3LmdpdGh1YnVzZXJjb250ZW50LmNvbS90cWVyMzkvZG90ZmlsZXMvbWFpbi9pbnN0YWxsLnBzMSc7CiAgICB9IGVsc2UgewogICAgICB0YXJnZXRVcmwgPSAnaHR0cHM6Ly9yYXcuZ2l0aHVidXNlcmNvbnRlbnQuY29tL3RxZXIzOS9kb3RmaWxlcy9tYWluL2luc3RhbGwuc2gnOwogICAgfQoKICAgIGNvbnN0IHJlc3BvbnNlID0gYXdhaXQgZmV0Y2godGFyZ2V0VXJsKTsKICAgIGNvbnN0IGJvZHkgPSBhd2FpdCByZXNwb25zZS50ZXh0KCk7CgogICAgcmV0dXJuIG5ldyBSZXNwb25zZShib2R5LCB7CiAgICAgIGhlYWRlcnM6IHsKICAgICAgICAnQ29udGVudC1UeXBlJzogJ3RleHQvcGxhaW47IGNoYXJzZXQ9dXRmLTgnLAogICAgICAgICdDYWNoZS1Db250cm9sJzogJ3B1YmxpYywgbWF4LWFnZT0zMDAnLAogICAgICB9LAogICAgfSk7CiAgfQp9Cg=="
              + content_sha256 = "c1097fb0291456342c956b6c87cadef5ac9c71caa064e894f717a8a0cc804dff"
              + content_type   = "application/javascript+module"
              + name           = "index.mjs"
            },
        ]
      ~ number              = 1 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      + startup_time_ms     = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.workers.cloudflare_workers_deployment.this["dotfiles-install-redirect"] must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      ~ author_email = "tqer39@gmail.com" -> (known after apply)
      ~ created_on   = "2025-12-22T15:51:08Z" -> (known after apply)
      ~ id           = "d8ff1708-6f47-4a5e-b9f7-1a472a9b5a7b" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "aa9fa3ad-b4df-441f-9039-112dbddae62b" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
